e2e/src/artillery/cloud.crm.yml
config:
  processor: ./processor.js
  plugins:
    influxdb:
      scope: "{{ $processEnvironment.ARTILLERY_ROOT }}/dist/plugins/"
      url: "{{ $processEnvironment.INFLUX_URL }}"
      token: "{{ $processEnvironment.INFLUX_TOKEN }}"
      organization: "{{ $processEnvironment.INFLUX_ORGANIZATION }}"
      bucket: "{{ $processEnvironment.INFLUX_BUCKET }}"
  includeFiles:
    - .env
    - ./employees
  environments:
    full_lst:
      phases:
        - duration: 300 # Run minutes 0-5
          arrivalRate: .25 # When starting our load test, we send one user per instance every 4 seconds until we reach maxVusers
          maxVusers: 1
          name: Warm Up
        - duration: 300 # Run minutes 5-10
          maxVusers: 4
          arrivalRate: .25
          name: Steady State
        - duration: 600 # Run minutes 10-20
          maxVusers: 8
          arrivalRate: .25
          name: Spike One
        - duration: 1200 # Run minutes 25-45
          maxVusers: 16
          arrivalRate: .25
          name: Spike Two
        - duration: 600 # Run minutes 45-55
          maxVusers: 4
          arrivalRate: .5
          name: Steady State
        - duration: 300 # Run minutes 55-65
          maxVusers: 2
          arrivalRate: .25
          name: Cool Down
    noSpikes_lst:
      phases:
        - duration: 300 # Run minutes 0-5
          arrivalRate: .25 # When starting our load test, we send one user per instance every 4 seconds until we reach maxVusers
          maxVusers: 1
          name: Warm Up
        - duration: 1800 # Run minutes 5-20
          maxVusers: 4
          arrivalRate: .25
          name: Steady State
        - duration: 300 # Run minutes 20-25
          maxVusers: 2
          arrivalRate: .25
          name: Cool Down
    basic:
      phases:
        - duration: 1
          arrivalRate: 1
          maxVusers: 1
          name: Development

scenarios:
  - name: CRM Search
    flow:
      - function: searchClaimants