e2e/src/artillery/spec.yml
config:
  processor: ./processor.js
  plugins:
    influxdb:
      scope: "{{ $processEnvironment.PWD }}/dist/plugins/"
      url: "{{ $processEnvironment.INFLUX_URL }}"
      token: "{{ $processEnvironment.INFLUX_TOKEN }}"
      organization: "{{ $processEnvironment.INFLUX_ORGANIZATION }}"
      bucket: "{{ $processEnvironment.INFLUX_BUCKET }}"
  includeFiles:
    - .env
    - ./employees
    - ./forms
  environments:
    performance:
      phases:
        - duration: 300 # Run minutes 0-5
          arrivalRate: .25 # When starting our load test, we send one user per instance every 4 seconds until we reach maxVusers
          maxVusers: 2
          name: Warm Up
        - duration: 300 # Run minutes 5-10
          maxVusers: 3
          arrivalRate: 1
          name: Steady State
        - duration: 900 # Run minutes 10-25
          maxVusers: 7
          arrivalRate: 1
          name: Spike One
        - duration: 900 # Run minutes 25-40
          maxVusers: 9
          arrivalRate: 1
          name: Spike Two
        - duration: 600 # Run minutes 40-50
          maxVusers: 3
          arrivalRate: 1
          name: Steady State
        - duration: 300 # Run minutes 50-60
          maxVusers: 2
          arrivalRate: 1
          name: Cool Down
    test:
      phases:
        - duration: 240
          arrivalRate: 1
          maxVusers: 2
          name: Development

scenarios:
  #  - name: "Test test"
  #    flow:
  #      - get:
  #          url: "https://paidleave-test.mass.gov"
  - name: BHAP1 End to End
    flow:
      # Artillery has no capability to pass arguments to a function, so we have a 1-1 relationship
      # between processor functions and E2E scenarios. That probably doesn't matter though.
      - function: submitAndAdjudicate